cases/Hecht_Panda_2019/cryogenic_H2_test_03/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// Test 1: T_nn = 43.9 K. Ambient: 293.15 K.

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    inlet_air
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    wallPipe
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }
    internalWalls
    {
        type            zeroGradient;
    }
    inlet_fuel
    {
        // Notional nozzle temperature. Update T_nn per test condition.
        type            fixedValue;
        value           uniform 43.9;
    }
    outlet
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
