cases/Hecht_Panda_2019/cryogenic_H2_test_03/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2.24e-4;

boundaryField
{
    inlet_air
    {
        type            calculated;
        value           $internalField;
    }
    wallPipe
    {
        type            calculated;
        value           $internalField;
    }
    internalWalls
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    inlet_fuel
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    "(front|back)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
