cases/Hecht_Panda_2019/cryogenic_H2_test_03/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// Absolute pressure. Inlet/walls: zeroGradient; outlets: fixedValue ambient.

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet_air
    {
        type            zeroGradient;
    }
    wallPipe
    {
        type            fixedValue;
        value           $internalField;
    }
    internalWalls
    {
        type            zeroGradient;
    }
    inlet_fuel
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    "(front|back)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
